OpenPuya/PY32F040_Firmware/Drivers/PY32F4xx_HAL_Driver/Src/py32f4xx_ll_sdmmc.c
	SDIO_SetClock(SDIOx, Init.ClockDiv);
			
  return HAL_OK;
}

/**
  * @brief  Enables the SDIO Clock.
  * @param  SDIOx: Pointer to SDIO register base.
  * @retval None
  */
void SDIO_ClockEnable(SDIO_TypeDef *SDIOx)
{
    __SDIO_ENABLE(SDIOx);

    /* Wait until start_cmd is cleared or an HLE is set; in case of an HLE, repeat the command */
    SDIOx->CMD |= (SDIO_CMD_STARTCMD_Msk | SDIO_CMD_REGSYNC_Msk |SDIO_CMD_WAITPEND_Msk);    
    while(SDIOx->CMD & SDIO_CMD_STARTCMD_Msk);
}

/**
  * @brief  Disables the SDIO Clock.
  * @param  SDIOx: Pointer to SDIO register base.
  * @retval None
  */
void SDIO_ClockDisable(SDIO_TypeDef *SDIOx)
{
    __SDIO_DISABLE(SDIOx);

    /* Wait until start_cmd is cleared or an HLE is set; in case of an HLE, repeat the command */
    SDIOx->CMD |= (SDIO_CMD_STARTCMD_Msk | SDIO_CMD_REGSYNC_Msk |SDIO_CMD_WAITPEND_Msk);    
    while(SDIOx->CMD & SDIO_CMD_STARTCMD_Msk);
}

/**
  * @brief  The SDIO loads each of these registers only when the start_cmd bit and the
  *         Update_clk_regs_only bit in the CMD register are set. When a command is successfully loaded, the
  *         SDIO Controller clears this bit, unless the SDIO Controller already has another command in the
  *         queue, at which point it gives an HLE (Hardware Locked Error);
  * @param  SDIOx: Pointer to SDIO register base.
  * @param  SDIO_ClkDiv: clock dividor
  * @retval None
  */
void SDIO_SetClock(SDIO_TypeDef *SDIOx,uint32_t SDIO_ClkDiv)
{
  uint32_t tmpreg;
  tmpreg = SDIOx->CLKCR;
  /* 1. Confirm that no card is engaged in any transaction; if there is a transaction, wait until it finishes. */
  while(__SDIO_IS_CARD_BUSY(SDIOx));
  /* 2. Stop all clocks by writing xxxx0000 to the CLKENA register. Set the start_cmd,
  *   Update_clk_regs_only, and wait_prvdata_complete bits in the CMD register. Wait until start_cmd is
  *   cleared or an HLE is set; in case of an HLE, repeat the command.
  */
  
  SDIO_ClockDisable(SDIOx);
  /* 3. Program the CLKDIV and CLKSRC registers, as required. Set the start_cmd, Update_clk_regs_only,
  *    and wait_prvdata_complete bits in the CMD register. Wait until start_cmd is cleared or an HLE is
  *    set; in case of an HLE, repeat the command.
  */
  tmpreg &= ~(SDIO_CLKCR_CLKDIV_Msk);
  tmpreg |= (uint32_t)(SDIO_ClkDiv & SDIO_CLKCR_CLKDIV_Msk);
  
  /*4. Re-enable all clocks by programming the CLKENA register. Set the start_cmd,
  *   Update_clk_regs_only, and wait_prvdata_complete bits in the CMD register. Wait until start_cmd is
  *   cleared or an HLE is set; in case of an HLE, repeat the command.
  */
  SDIOx->CLKCR = tmpreg;
  SDIO_ClockEnable(SDIOx);
}

/**
  * @}
  */

/** @defgroup HAL_SDMMC_LL_Group2 IO operation functions 
 *  @brief   Data transfers functions 
 *
@verbatim   
 ===============================================================================
                      ##### I/O operation functions #####
 ===============================================================================  
    [..]
    This subsection provides a set of functions allowing to manage the SDMMC data 
    transfers.

@endverbatim
  * @{
  */

/**
  * @brief  Read data (word) from Rx FIFO in blocking mode (polling) 
  * @param  SDIOx: Pointer to SDMMC register base
  * @retval HAL status
  */
uint32_t SDIO_ReadFIFO(SDIO_TypeDef *SDIOx)
{
  /* Read data from Rx FIFO */ 
  return (SDIOx->FIFODATA);
}

/**
  * @brief  Write data (word) to Tx FIFO in blocking mode (polling) 
  * @param  SDIOx: Pointer to SDMMC register base
  * @param  pWriteData: pointer to data to write
  * @retval HAL status
  */
HAL_StatusTypeDef SDIO_WriteFIFO(SDIO_TypeDef *SDIOx, uint32_t *pWriteData)
{ 
  /* Write data to FIFO */ 
  SDIOx->FIFODATA = *pWriteData;

  return HAL_OK;
}

/**
  * @}
  */

/** @defgroup HAL_SDMMC_LL_Group3 Peripheral Control functions 
 *  @brief   management functions 
 *
@verbatim   
 ===============================================================================
                      ##### Peripheral Control functions #####
 ===============================================================================  
    [..]
    This subsection provides a set of functions allowing to control the SDMMC data 
    transfers.

@endverbatim
  * @{
  */

/**
  * @brief  Set SDMMC Power state to ON. 
  * @param  SDIOx: Pointer to SDMMC register base
  * @retval HAL status
  */
HAL_StatusTypeDef SDIO_PowerState_ON(SDIO_TypeDef *SDIOx)
{  
  /* Set power state to ON */ 
  SDIOx->POWER = SDIO_POWER_PWRCTRL;

  /* 1ms: required power up waiting time before starting the SD initialization
  sequence */
  HAL_Delay(2);
  
  return HAL_OK;
}

/**
  * @brief  Set SDMMC Power state to OFF. 
  * @param  SDIOx: Pointer to SDMMC register base
  * @retval HAL status
  */
HAL_StatusTypeDef SDIO_PowerState_OFF(SDIO_TypeDef *SDIOx)
{
  /* Set power state to OFF */
  SDIOx->POWER = (uint32_t)0x00000000;
  
  return HAL_OK;
}

/**
  * @brief  Get SDMMC Power state. 
  * @param  SDIOx: Pointer to SDMMC register base
  * @retval Power status of the controller. The returned value can be one of the 
  *         following values:
  *            - 0x00: Power OFF
  *            - 0x02: Power UP
  *            - 0x03: Power ON 
  */
uint32_t SDIO_GetPowerState(SDIO_TypeDef *SDIOx)  
{
  return (SDIOx->POWER & SDIO_POWER_PWRCTRL);
}

/**
  * @brief  Configure the SDMMC command path according to the specified parameters in
  *         SDIO_CmdInitTypeDef structure and send the command 
  * @param  SDIOx: Pointer to SDMMC register base
  * @param  Command: pointer to a SDIO_CmdInitTypeDef structure that contains 
  *         the configuration information for the SDMMC command
  * @retval HAL status
  */
HAL_StatusTypeDef SDIO_SendCommand(SDIO_TypeDef *SDIOx, SDIO_CmdInitTypeDef *Command)
{
  uint32_t tmpreg = 0;
  
  /* Check the parameters */
  assert_param(IS_SDIO_CMD_INDEX(Command->CmdIndex));
  assert_param(IS_SDIO_RESPONSE(Command->Response));
  assert_param(IS_SDIO_WAITPEND(Command->WaitPend));
  assert_param(IS_SDIO_CPSM(Command->CPSM));
  assert_param(IS_SDIO_AUTOINIT(Command->AutoInit));
  assert_param(IS_SDIO_CHECKCRC(Command->CheckCRC));
  assert_param(IS_SDIO_DATATRANSFER(Command->DataTransfer));

  /* Set the SDMMC Argument value */
  SDIOx->ARG = Command->Argument;

  /* Set SDMMC command parameters */
  tmpreg |= (uint32_t)(Command->CmdIndex | Command->Response |\
                       Command->WaitPend | Command->AutoInit |\
                       Command->CheckCRC | Command->DataTransfer |\
                       Command->CPSM);
  
  /* Write to SDMMC CMD register */
  MODIFY_REG(SDIOx->CMD, CMD_CLEAR_MASK, tmpreg); 
  
